# read_verilog /media/anx/New_Volume/Importants/Verilog/open_sta/rtl_files/Top_Module.v
# hierarchy -top Top_Module

# proc
# synth_xilinx -top Top_Module
# opt_clean -purge
# stat
# write_verilog -noattr -noexpr xilinx_netlist.v


read_verilog /media/anx/New_Volume/Importants/Verilog/open_sta/rtl_files/Top_Module.v
hierarchy -top Top_Module
proc
opt

check
opt
synth_xilinx -top Top_Module

opt_clean -purge

check
stat
write_verilog -noattr -noexpr xilinx_netlist.v



# memory_collect
# memory_map

# proc
# opt
# memory
# opt
# techmap
# opt

# dfflibmap -liberty /home/anx/OpenSTA/examples/nangate45_fast.lib

# splitnets -ports
# opt
# abc -liberty /home/anx/OpenSTA/examples/nangate45_fast.lib -script +strash;ifraig;scorr;dc2;dretime;strash;&get,-n;&dch,-f;&nf,{D};&put


# stat -liberty /home/anx/OpenSTA/examples/nangate45_fast.lib
